:PROPERTIES:
:ID:       436EB0B7-811E-4828-BBF7-4126517DD7C6
:END:
#+title: emacs

* Help

** Describe Things

*** describe-function

#+begin_src emacs-lisp
  (describe-function #'describe-function)
#+end_src

#+RESULTS:
#+begin_example
describe-function is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h f, <f1> f and <help> f.
It can also be invoked from the menu: Help → Describe → Describe
Function...

(describe-function FUNCTION)

Display the full documentation of FUNCTION (a symbol).
When called from Lisp, FUNCTION may also be a function object.

See the ‘help-enable-symbol-autoload’ variable for special
handling of autoloaded functions.

  Probably introduced at or before Emacs version 22.1.

#+end_example

*** describe-mode

#+begin_src emacs-lisp
  (describe-function #'describe-mode)
#+end_src

#+RESULTS:
#+begin_example
describe-mode is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h m, <f1> m and <help> m.
It can also be invoked from the menu: Help → Describe → Describe
Buffer Modes

(describe-mode &optional BUFFER)

Display documentation of current major mode and minor modes.
A brief summary of the minor modes comes first, followed by the
major mode description.  This is followed by detailed
descriptions of the minor modes, each on a separate page.

For this to work correctly for a minor mode, the mode’s indicator
variable (listed in ‘minor-mode-alist’) must also be a function
whose documentation describes the minor mode.

If called from Lisp with a non-nil BUFFER argument, display
documentation for the major and minor modes of that buffer.

When ‘describe-mode-outline’ is non-nil, Outline minor mode
is enabled in the Help buffer.

  Probably introduced at or before Emacs version 29.1.

#+end_example

*** describe-package

#+begin_src emacs-lisp
  (describe-function #'describe-package)
#+end_src

#+RESULTS:
#+begin_example
describe-package is an autoloaded interactive byte-code-function in
‘package.el’.

It is bound to C-h P, <f1> P and <help> P.
It can also be invoked from the menu: Help → Describe → Describe
Package...

(describe-package PACKAGE)

Display the full documentation of PACKAGE (a symbol).

  Probably introduced at or before Emacs version 24.1.

#+end_example

*** describe-variable

#+begin_src emacs-lisp
  (describe-function #'describe-variable)
#+end_src

#+RESULTS:
#+begin_example
describe-variable is an autoloaded interactive byte-code-function in
‘help-fns.el’.

It is bound to C-h v, <f1> v and <help> v.
It can also be invoked from the menu: Help → Describe → Describe
Variable...

(describe-variable VARIABLE &optional BUFFER FRAME)

Display the full documentation of VARIABLE (a symbol).
Returns the documentation as a string, also.
If VARIABLE has a buffer-local value in BUFFER or FRAME
(default to the current buffer and current frame),
it is displayed along with the global value.

  Probably introduced at or before Emacs version 27.1.

#+end_example


** Discover Things

*** shortdoc

#+begin_src emacs-lisp
  (describe-function #'shortdoc)
#+end_src

#+RESULTS:
: shortdoc is an alias for ‘shortdoc-display-group’ in ‘shortdoc.el’.
: 
: (shortdoc GROUP &optional FUNCTION SAME-WINDOW)
: 
: Pop to a buffer with short documentation summary for functions in GROUP.
: Interactively, prompt for GROUP.
: If FUNCTION is non-nil, place point on the entry for FUNCTION (if any).
: If SAME-WINDOW, don’t pop to a new window.
: 

* Environment Info

** user-emacs-directory

#+begin_src emacs-lisp
  (describe-variable 'user-emacs-directory)
#+end_src

#+RESULTS:
#+begin_example
user-emacs-directory is a variable defined in ‘subr.el’.

Its value is "~/.emacs.d/"

Directory beneath which additional per-user Emacs-specific files are placed.
Various programs in Emacs store information in this directory.
Note that this should end with a directory separator.
See also ‘locate-user-emacs-file’.

  Probably introduced at or before Emacs version 23.1.

#+end_example

* Point

** point

#+begin_src emacs-lisp
  (describe-function #'point)
#+end_src

#+RESULTS:
#+begin_example
point is a primitive-function in ‘C source code’.

(point)

Declared type: (function nil integer)

Return value of point, as an integer.
Beginning of buffer is position (point-min).

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 17.
  This function does not change global state, including the match
    data.
  This function has a ‘byte-compile’ property ‘byte-compile-no-args’.
    See the manual for details.

#+end_example

#+begin_src emacs-lisp
  (point)
#+end_src

#+RESULTS:
: 2583

** point-min

#+begin_src emacs-lisp
  (describe-function #'point-min)
#+end_src

#+RESULTS:
#+begin_example
point-min is a primitive-function in ‘C source code’.

(point-min)

Declared type: (function nil integer)

Return the minimum permissible value of point in the current buffer.
This is 1, unless narrowing (a buffer restriction) is in effect.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 17.
  This function does not change global state, including the match
    data.
  This function has a ‘byte-compile’ property ‘byte-compile-no-args’.
    See the manual for details.

#+end_example

#+begin_src emacs-lisp
  (point-min)
#+end_src

#+RESULTS:
: 1

* Buffers

#+begin_src emacs-lisp :results value
  (save-excursion
    (shortdoc 'buffer)
    (buffer-substring-no-properties (point-min) (point-max)))
#+end_src

#+RESULTS:
#+begin_example
Buffer Basics

(current-buffer)
  Return the current buffer as a Lisp object.
  (current-buffer)
    e.g. ⇒ #<buffer shortdoc.el>


(bufferp object)
  Return t if OBJECT is an editor buffer.
  (bufferp 23)
    ⇒ nil


(buffer-live-p object)
  Return t if OBJECT is a buffer which has not been killed.
  (buffer-live-p some-buffer)
    e.g. ⇒ t


(buffer-modified-p &optional buffer)
  Return non-nil if BUFFER was modified since its file was last read or saved.
  (buffer-modified-p (current-buffer))
    ⇒ t


(buffer-name &optional buffer)
  Return the name of BUFFER, as a string.
  (buffer-name)
    ⇒ "*Shortdoc buffer*"


(window-buffer &optional window)
  Return the buffer displayed in window WINDOW.
  (window-buffer)
    ⇒ #<buffer 20260616070446-emacs.org>

Selecting Buffers

(get-buffer-create buffer-or-name &optional inhibit-buffer-hooks)
  Return the buffer specified by BUFFER-OR-NAME, creating a new one if needed.
  (get-buffer-create "*foo*")
    e.g. ⇒ #<buffer *foo*>


(pop-to-buffer buffer-or-name &optional action norecord)
  Display buffer specified by BUFFER-OR-NAME and select its window.
  (pop-to-buffer "*foo*")
    e.g. ⇒ #<buffer *foo*>


(with-current-buffer buffer-or-name &rest body)
  Execute the forms in BODY with BUFFER-OR-NAME temporarily current.
  (with-current-buffer buffer (buffer-size))
    → [it depends]

Points and Positions

(point)
  Return value of point, as an integer.
  (point)
    ⇒ 1441


(point-min)
  Return the minimum permissible value of point in the current buffer.
  (point-min)
    ⇒ 1


(point-max)
  Return the maximum permissible value of point in the current buffer.
  (point-max)
    ⇒ 1658


(pos-bol &optional n)
  Return the position of the first character on the current line.
  (pos-bol)
    ⇒ 1753


(pos-eol &optional n)
  Return the position of the last character on the current line.
  (pos-eol)
    ⇒ 1871


(bolp)
  Return t if point is at the beginning of a line.
  (bolp)
    ⇒ nil


(eolp)
  Return t if point is at the end of a line.
  (eolp)
    ⇒ t


(line-beginning-position &optional n)
  Return the position of the first character in the current line/field.
  (line-beginning-position)
    ⇒ 2166


(line-end-position &optional n)
  Return the position of the last character in the current line/field.
  (line-end-position)
    ⇒ 2310


(buffer-size &optional buffer)
  Return the number of characters in the current buffer.
  (buffer-size)
    ⇒ 2421


(bobp)
  Return t if point is at the beginning of the buffer.
  (bobp)
    ⇒ nil


(eobp)
  Return t if point is at the end of the buffer.
  (eobp)
    ⇒ t

Moving Around

(goto-char position)
  Set point to POSITION, a number or marker.
  (goto-char (point-max))
    e.g. ⇒ 342


(search-forward string &optional bound noerror count)
  Search forward from point for STRING.
  (search-forward "some-string" nil t)
    e.g. ⇒ 245


(re-search-forward regexp &optional bound noerror count)
  Search forward from point for regular expression REGEXP.
  (re-search-forward "some-s.*g" nil t)
    e.g. ⇒ 245


(forward-line &optional n)
  Move N lines forward (backward if N is negative).
  (forward-line 1)
    e.g. ⇒ 0
  (forward-line -2)
    e.g. ⇒ 0

Strings from Buffers

(buffer-string)
  Return the contents of the current buffer as a string.
  (buffer-string)
    → [it depends]


(buffer-substring start end)
  Return the contents of part of the current buffer as a string.
  (buffer-substring (point-min) (+ (point-min) 10))
    ⇒ #("Buffer Bas" 0 10 (face shortdoc-heading shortdoc-section t outline-level 1))


(buffer-substring-no-properties start end)
  Return the characters of part of the buffer, without the text properties.
  (buffer-substring-no-properties (point-min) (+ (point-min) 10))
    ⇒ "Buffer Bas"


(following-char)
  Return the character following point, as a number.
  (following-char)
    e.g. ⇒ 67


(preceding-char)
  Return the character preceding point, as a number.
  (preceding-char)
    e.g. ⇒ 38


(char-after &optional pos)
  Return character in current buffer at position POS.
  (char-after 45)
    ⇒ 32


(char-before &optional pos)
  Return character in current buffer preceding position POS.
  (char-before 13)
    ⇒ 99


(get-byte &optional position string)
  Return a byte value of a character at point.
  (get-byte 45)
    e.g. ⇒ #xff

Altering Buffers

(delete-region start end)
  Delete the text between START and END.
  (delete-region (point-min) (point-max))


(erase-buffer)
  Delete the entire contents of the current buffer.
  (erase-buffer)


(delete-line)
  Delete the current line.
  (delete-line)


(insert &rest args)
  Insert the arguments, either strings or characters, at point.
  (insert "This string will be inserted in the buffer\n")


(subst-char-in-region start end fromchar tochar &optional noundo)
  From START to END, replace FROMCHAR with TOCHAR each time it occurs.
  (subst-char-in-region (point-min) (point-max) ?+ ?-)


(replace-string-in-region string replacement &optional start end)
  Replace STRING with REPLACEMENT in the region from START to END.
  (replace-string-in-region "foo" "bar")

Locking

(lock-buffer &optional file)
  Lock FILE, if current buffer is modified.
  (lock-buffer "/tmp/foo")


(unlock-buffer)
  Unlock the file visited in the current buffer.
  (unlock-buffer)
#+end_example

** ->string

[[id:F2F61FB6-88DE-4275-B318-3B42CA58D65D][cl-defmethod]]

#+begin_src emacs-lisp
  (cl-defmethod ->string (ctx (obj buffer))
    (with-current-buffer obj
      (buffer-string)))
#+end_src

** buffer-string

#+begin_src emacs-lisp
  (describe-function #'buffer-string)
#+end_src

#+RESULTS:
#+begin_example
buffer-string is a primitive-function in ‘src/editfns.c’.

(buffer-string)

Declared type: (function nil string)

Return the contents of the current buffer as a string.
If narrowing is in effect, this function returns only the visible part
of the buffer.

This function copies the text properties of that part of the buffer
into the result string; if you don’t want the text properties,
use ‘buffer-substring-no-properties’ instead.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 20.1.
  This function does not change global state, including the match data.

#+end_example

** save-current-buffer

#+begin_src emacs-lisp
  (describe-function #'save-current-buffer)
#+end_src

#+RESULTS:
#+begin_example
save-current-buffer is a special-form in ‘C source code’.

(save-current-buffer &rest BODY)

Record which buffer is current; execute BODY; make that buffer current.
BODY is executed just like ‘progn’.

  Probably introduced at or before Emacs version 20.1.
  This function has a ‘byte-compile’ property
    ‘byte-compile-save-current-buffer’.  See the manual for details.

#+end_example

** with-current-buffer

#+begin_src emacs-lisp
  (describe-function #'with-current-buffer)
#+end_src

#+RESULTS:
#+begin_example
with-current-buffer is a Lisp macro in ‘subr.el’.

(with-current-buffer BUFFER-OR-NAME &rest BODY)

Execute the forms in BODY with BUFFER-OR-NAME temporarily current.
BUFFER-OR-NAME must be a buffer or the name of an existing buffer.
The value returned is the value of the last form in BODY.  See
also ‘with-temp-buffer’.

  Other relevant functions are documented in the buffer group.
  Probably introduced at or before Emacs version 20.1.

#+end_example

* Clearing out definitions

** makunbound

#+begin_src emacs-lisp
  (describe-function #'makunbound)
#+end_src

#+RESULTS:
#+begin_example
makunbound is a primitive-function in ‘C source code’.

(makunbound SYMBOL)

Empty out the value cell of SYMBOL, making it void as a variable.
Return SYMBOL.

If a variable is void, trying to evaluate the variable signals a
‘void-variable’ error, instead of returning a value.  For more
details, see Info node ‘(elisp) Void Variables’.

See also ‘fmakunbound’.

#+end_example

** fmakunbound

#+begin_src emacs-lisp
  (describe-function #'fmakunbound)
#+end_src

#+RESULTS:
#+begin_example
fmakunbound is a primitive-function in ‘C source code’.

(fmakunbound SYMBOL)

Make SYMBOL’s function definition be nil.
Return SYMBOL.

If a function definition is nil, trying to call a function by
that name will cause a ‘void-function’ error.  For more details, see
Info node ‘(elisp) Function Cells’.

See also ‘makunbound’.

#+end_example

* Compilation

** byte-force-recompile

#+begin_src emacs-lisp
  (describe-function #'byte-force-recompile)
#+end_src

#+RESULTS:
#+begin_example
byte-force-recompile is an autoloaded interactive byte-code-function
in ‘bytecomp.el’.

(byte-force-recompile DIRECTORY)

Recompile every ‘.el’ file in DIRECTORY that already has a ‘.elc’ file.
Files in subdirectories of DIRECTORY are processed also.

  Probably introduced at or before Emacs version 19.30.

#+end_example

* Packages

** package-delete

#+begin_src emacs-lisp
  (describe-function #'package-delete)
#+end_src

#+RESULTS:
#+begin_example
package-delete is an interactive byte-code-function in ‘package.el’.

(package-delete PKG-DESC &optional FORCE NOSAVE)

Delete package PKG-DESC.

Argument PKG-DESC is the full description of the package, for example as
obtained by ‘package-get-descriptor’.  Interactively, prompt the user
for the package name and version.

When package is used elsewhere as dependency of another package,
refuse deleting it and return an error.
If prefix argument FORCE is non-nil, package will be deleted even
if it is used elsewhere.
If NOSAVE is non-nil, the package is not removed from
‘package-selected-packages’.

  Probably introduced at or before Emacs version 25.1.

#+end_example

** package-get-descriptor

#+begin_src emacs-lisp
  (describe-function #'package-get-descriptor)
#+end_src

#+RESULTS:
: package-get-descriptor is a byte-code-function in ‘package.el’.
: 
: (package-get-descriptor PKG-NAME)
: 
: Return the ‘package-desc’ of PKG-NAME.
: 

** package-list-packages

#+begin_src emacs-lisp
  (describe-function #'package-list-packages)
#+end_src

#+RESULTS:
#+begin_example
package-list-packages is an alias for ‘list-packages’ in ‘package.el’.

It can be invoked from the menu: Options → Manage Emacs Packages

(package-list-packages &optional NO-FETCH)

Display a list of packages.
This first fetches the updated list of packages before
displaying, unless a prefix argument NO-FETCH is specified.
The list is displayed in a buffer named ‘*Packages*’, and
includes the package’s version, availability status, and a
short description.

#+end_example

** package-upgrade-all

#+begin_src emacs-lisp
  (describe-function #'package-upgrade-all)
#+end_src

#+RESULTS:
#+begin_example
package-upgrade-all is an autoloaded interactive byte-code-function in
‘package.el’.

(package-upgrade-all &optional QUERY)

Refresh package list and upgrade all packages.
If QUERY, ask the user before upgrading packages.  When called
interactively, QUERY is always true.

Currently, packages which are part of the Emacs distribution are
not upgraded by this command.  To enable upgrading such a package
using this command, first upgrade the package to a newer version
from ELPA by either using ‘M-x package-upgrade’ or
‘i’ after ‘M-x list-packages’.

  Probably introduced at or before Emacs version 29.1.

#+end_example

#+begin_src emacs-lisp
  (package-upgrade-all)
#+end_src

#+RESULTS:
| transient | prop-menu | llama | idris-mode | emacsql | cond-let |
